/**
 * Created by Yuriy on 12.02.2016.
 */
public class Loop {
    public static void main(String[] args) {
        int n = 8; // змінній н присвоюємо значення максимально можливого елемента
        for (int i = 1; i <= n; i++) {// збільшуємо значення і на одиницю доки воно не стане рівним н
            for (int j = i; j >= 1; j--) {// доки j не буде більшим або рівним одиниці зменшуємо його на одиницю
                System.out.print(j+"  "); // виводимо на друк j і пробіл
            }
            System.out.println();//щоб кожен строка йшла з нового рядка
        }

    }
}
